loadtest/artillery-config.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: 'Warm up'
    - duration: 120
      arrivalRate: 50
      name: 'Load test'
    - duration: 60
      arrivalRate: 100
      name: 'Peak load'
  processor: './processor.js'

scenarios:
  - name: 'API Load Test'
    flow:
      - get:
          url: '/api/poi'
      - get:
          url: '/api/creatures'
      - get:
          url: '/api/map/poi'
          qs:
            lat: 46.06
            lng: 13.23